<template>
  <svg
    id="_001-traffic-light"
    data-name="001-traffic-light"
    xmlns="http://www.w3.org/2000/svg"
    width="30.978"
    height="36.538"
    viewBox="0 0 30.978 36.538"
  >
    <g
      id="Сгруппировать_3408"
      data-name="Сгруппировать 3408"
      transform="translate(7.149)"
    >
      <g id="Сгруппировать_3407" data-name="Сгруппировать 3407">
        <path
          id="Контур_3576"
          data-name="Контур 3576"
          d="M147.47,0a8.35,8.35,0,0,0-8.34,8.34V34.155a2.385,2.385,0,0,0,2.383,2.383h11.915a2.385,2.385,0,0,0,2.383-2.383V8.34A8.35,8.35,0,0,0,147.47,0Zm0,30.978a3.574,3.574,0,1,1,3.574-3.574A3.578,3.578,0,0,1,147.47,30.978Zm0-9.532a3.574,3.574,0,1,1,3.574-3.574A3.578,3.578,0,0,1,147.47,21.446Zm0-9.532a3.574,3.574,0,1,1,3.574-3.574A3.578,3.578,0,0,1,147.47,11.915Z"
          transform="translate(-139.13)"
          fill="#fff"
        />
      </g>
    </g>
    <g
      id="Сгруппировать_3410"
      data-name="Сгруппировать 3410"
      transform="translate(25.586 4.766)"
    >
      <g
        id="Сгруппировать_3409"
        data-name="Сгруппировать 3409"
        transform="translate(0)"
      >
        <path
          id="Контур_3577"
          data-name="Контур 3577"
          d="M401.694,66.783h-4.2a10.65,10.65,0,0,1,.626,3.574v3.454a5.967,5.967,0,0,0,4.766-5.837A1.191,1.191,0,0,0,401.694,66.783Z"
          transform="translate(-397.494 -66.783)"
          fill="#fff"
        />
      </g>
    </g>
    <g
      id="Сгруппировать_3412"
      data-name="Сгруппировать 3412"
      transform="translate(26.212 14.298)"
    >
      <g
        id="Сгруппировать_3411"
        data-name="Сгруппировать 3411"
        transform="translate(0)"
      >
        <path
          id="Контур_3578"
          data-name="Контур 3578"
          d="M409.835,200.348h-3.574v7.029a5.967,5.967,0,0,0,4.766-5.837A1.191,1.191,0,0,0,409.835,200.348Z"
          transform="translate(-406.261 -200.348)"
          fill="#fff"
        />
      </g>
    </g>
    <g
      id="Сгруппировать_3414"
      data-name="Сгруппировать 3414"
      transform="translate(26.212 23.829)"
    >
      <g
        id="Сгруппировать_3413"
        data-name="Сгруппировать 3413"
        transform="translate(0)"
      >
        <path
          id="Контур_3579"
          data-name="Контур 3579"
          d="M409.835,333.913h-3.574v7.029a5.967,5.967,0,0,0,4.766-5.837A1.191,1.191,0,0,0,409.835,333.913Z"
          transform="translate(-406.261 -333.913)"
          fill="#fff"
        />
      </g>
    </g>
    <g
      id="Сгруппировать_3416"
      data-name="Сгруппировать 3416"
      transform="translate(0 23.829)"
    >
      <g id="Сгруппировать_3415" data-name="Сгруппировать 3415">
        <path
          id="Контур_3580"
          data-name="Контур 3580"
          d="M40.147,333.913a1.191,1.191,0,0,0-1.191,1.191,5.967,5.967,0,0,0,4.766,5.837v-7.029Z"
          transform="translate(-38.956 -333.913)"
          fill="#fff"
        />
      </g>
    </g>
    <g
      id="Сгруппировать_3418"
      data-name="Сгруппировать 3418"
      transform="translate(0 14.298)"
    >
      <g id="Сгруппировать_3417" data-name="Сгруппировать 3417">
        <path
          id="Контур_3581"
          data-name="Контур 3581"
          d="M40.147,200.348a1.191,1.191,0,0,0-1.191,1.191,5.967,5.967,0,0,0,4.766,5.837v-7.029Z"
          transform="translate(-38.956 -200.348)"
          fill="#fff"
        />
      </g>
    </g>
    <g
      id="Сгруппировать_3420"
      data-name="Сгруппировать 3420"
      transform="translate(0 4.766)"
    >
      <g id="Сгруппировать_3419" data-name="Сгруппировать 3419">
        <path
          id="Контур_3582"
          data-name="Контур 3582"
          d="M40.147,66.783a1.191,1.191,0,0,0-1.191,1.191,5.967,5.967,0,0,0,4.766,5.837V70.357a10.651,10.651,0,0,1,.626-3.574Z"
          transform="translate(-38.956 -66.783)"
          fill="#fff"
        />
      </g>
    </g>
  </svg>
</template>

<script>
  export default {
    name: 'IconLights',
  }
</script>
